import SecondDeveloper from "@/assets/image/secondDeveloper.svg";
import tempCard from "@/assets/image/tempCard.png";

export const buildPriceCard = [
    {
        name: "Солнечный рай",
        adress: "25 строение, Морской бульвар, Анталия, Турция",
        date: "23.03.2023",
        course: "18.23",
        prices: "98 700 - 115 900",
        quarter: "1-й квартал 2025",
        items: ["Продажи открытые", "Строится"],
        developer: {
            img: <SecondDeveloper />,
            title: "DOMO COMPANY",
            workDone: "34 дома сдано",
            wip: "133 дома в процессе",
            color: "#2365af",
        },
        fakePriceCard: [
            {
                num: "1",
                price: "3.24",
                additional: "101 505 - 654 485",
                mettres: "75-15",
            },
            {
                num: "2",
                price: "3.24",
                additional: "101 505 - 654 485",
                mettres: "75-15",
                sold: true,
            },
            {
                num: "3",
                price: "3.24",
                additional: "101 505 - 654 485",
                mettres: "75-15",
            },
            {
                num: "4",
                price: "3.24",
                additional: "101 505 - 654 485",
                mettres: "75-15",
                sold: true,
            },
        ],
        characheristic: [
            { title: "класс", subTitle: "2,7-3 м (от пола до потолка)" },
            { title: "класс", subTitle: "Бизнес" },
            { title: "класс", subTitle: "2,7-3 м (от пола до потолка)" },
            { title: "класс", subTitle: "Бизнес" },
            { title: "класс", subTitle: "Бизнес" },
            { title: "класс", subTitle: "Бизнес" },
            { title: "класс", subTitle: "2,7-3 м (от пола до потолка)" },
            { title: "класс", subTitle: "Бизнес" },
            { title: "класс", subTitle: "Бизнес" },
            { title: "класс", subTitle: "Бизнес" },
        ],
        documents: [
            {
                date: ["март 2023"],
                docs: [
                    {
                        id: "1",
                        title: "Документы на земельный участок",
                        descr: "Есть документы на земельный участок",
                    },
                    {
                        id: "1",
                        title: "Документы на земельный участок",
                        descr: "Есть документы на земельный участок",
                    },
                    {
                        id: "1",
                        title: "Документы на земельный участок",
                        descr: "Есть документы на земельный участок",
                    },
                    {
                        id: "1",
                        title: "Документы на земельный участок",
                        descr: "Есть документы на земельный участок",
                    },
                ],
            },
        ],
        aboutProject: [
            {
                text: "<p>После внесения задатка квартира будет зарезервирована за вами в течение 14 дней после полной оплаты и подписания договора. После оплаты наш менеджер свяжется с вами. После внесения задатка квартира будет зарезервирована за вами в течение 14 дней после полной оплаты и подписания договора. После оплаты наш менеджер свяжется с вами. После внесения задатка квартира будет зарезервирована за вами в течение 14 дней после полной оплаты и подписания договора. <br/> <br/> После оплаты наш менеджер свяжется с вами. После внесения задатка квартира будет зарезервирована за вами в течение 14 дней после полной оплаты и подписания договора. После оплаты наш менеджер свяжется с вами. После внесения задатка квартира будет зарезервирована за вами в течение 14 дней после полной оплаты и подписания договора. После оплаты наш менеджер свяжется с вами.</p> <h2>Инфраструктура</h2> <p>После внесения задатка квартира будет зарезервирована за вами в течение 14 дней после полной оплаты и подписания договора. После оплаты наш менеджер свяжется с вами. После внесения задатка квартира будет зарезервирована за вами в течение 14 дней после полной оплаты и подписания договора. После оплаты наш менеджер свяжется с вами. После внесения задатка квартира будет зарезервирована за вами в течение 14 дней после полной оплаты и подписания договора. После оплаты наш менеджер свяжется с вами.</p> <h2>Особенности</h2> <p>После внесения задатка квартира будет зарезервирована за вами в течение 14 дней после полной оплаты и подписания договора. После оплаты наш менеджер свяжется с вами. После внесения задатка квартира будет зарезервирована за вами в течение 14 дней после полной оплаты и подписания договора. После оплаты наш менеджер свяжется с вами. После внесения задатка квартира будет зарезервирована за вами в течение 14 дней после полной оплаты и подписания договора. После оплаты наш менеджер свяжется с вами.</p>",
            },
        ],
        constructionStatus: [
            {
                updated: "25.03.2023",
                cards: [
                    {
                        img: tempCard,
                        title: "ЖК ПЕРСПЕКТИВА",
                        subTitle: "Район Южный",
                        geolocation: "25 ПРОСПЕКТ ВРАНГЕЛЯ, АНТАЛИЯ",
                        already: 4,
                        subTitle: "Введено в 4 квартале 2022",
                    },
                    {
                        img: tempCard,
                        title: "ЖК ПЕРСПЕКТИВА",
                        subTitle: "Район Южный",
                        geolocation: "25 ПРОСПЕКТ ВРАНГЕЛЯ, АНТАЛИЯ",
                        already: 4,
                        subTitle: "Введено в 4 квартале 2022",
                    },
                    {
                        img: tempCard,
                        title: "ЖК ПЕРСПЕКТИВА",
                        subTitle: "Район Южный",
                        geolocation: "25 ПРОСПЕКТ ВРАНГЕЛЯ, АНТАЛИЯ",
                        already: 3,
                        subTitle: "Запланировано на 4 квартал 2023",
                    },
                    {
                        img: tempCard,
                        title: "ЖК ПЕРСПЕКТИВА",
                        subTitle: "Район Южный",
                        geolocation: "25 ПРОСПЕКТ ВРАНГЕЛЯ, АНТАЛИЯ",
                        already: 1,
                        subTitle: "Запланировано на 4 квартал 2023",
                    },
                ],
            },
        ],
        recomendation: [
            {
                img: tempCard,
                contribution: "ПЕРВЫЙ ВЗНОС 16 000 USD",
                title: "ЖК ПЕРСПЕКТИВА",
                subTitle: "Район Южный",
                from: "02.05.2023",
                to: "30.06.2023",
                descr: "После внесения задатка квартира будет зарезервирована за вами в течение 14 дней после полной оплаты и подписания договора. После оплаты наш менеджер свяжется с вами...",
            },
            {
                img: tempCard,
                contribution: "ПЕРВЫЙ ВЗНОС 16 000 USD",
                title: "ЖК ПЕРСПЕКТИВА",
                subTitle: "Район Южный",
                from: "02.05.2023",
                to: "30.06.2023",
                descr: "После внесения задатка квартира будет зарезервирована за вами в течение 14 дней после полной оплаты и подписания договора. После оплаты наш менеджер свяжется с вами...",
            },
            {
                img: tempCard,
                contribution: "ПЕРВЫЙ ВЗНОС 16 000 USD",
                title: "ЖК ПЕРСПЕКТИВА",
                subTitle: "Район Южный",
                from: "02.05.2023",
                to: "30.06.2023",
                descr: "После внесения задатка квартира будет зарезервирована за вами в течение 14 дней после полной оплаты и подписания договора. После оплаты наш менеджер свяжется с вами...",
            },
            {
                img: tempCard,
                contribution: "ПЕРВЫЙ ВЗНОС 16 000 USD",
                title: "ЖК ПЕРСПЕКТИВА",
                subTitle: "Район Южный",
                from: "02.05.2023",
                to: "30.06.2023",
                descr: "После внесения задатка квартира будет зарезервирована за вами в течение 14 дней после полной оплаты и подписания договора. После оплаты наш менеджер свяжется с вами...",
            },
        ],
    },
];
